In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
box_path = "\\Users\\User\\Dropbox\\"

#year = 2022
name = 'PTTGC'
#buy_date = '2021-06-15' # oldest active record

In [2]:
format_dict = {'qty':'{:,}',
              'sell_price':'{:,.2f}','buy_price':'{:,.2f}','diff':'{:,.2f}',
              'sell_amt':'{:,.2f}','buy_amt':'{:,.2f}','gross':'{:,.2f}','profit':'{:,.2f}',
              'pct':'{:,.2f}%','net':'{:,.2f}',
              'cost_amt':'{:,.2f}','unit_cost':'{:,.2f}','avg_cost':'{:,.2f}'}

pd.set_option('display.float_format','{:,.2f}'.format)

### Record selection for active stocks

In [3]:
sql = '''
SELECT name, buys.date AS buy_date,
buys.price AS unit_cost, qty, 
(buys.price * qty) AS cost_amt, net
FROM buys
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s' AND status = 'Active'
ORDER BY buys.date DESC'''
sql = sql % name
print(sql)

buys_df = pd.read_sql(sql, conpf)
buys_df.style.format(format_dict)

SELECT name, buys.date AS buy_date,
buys.price AS unit_cost, qty,
(buys.price * qty) AS cost_amt, net
FROM buys
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = 'PTTGC' AND status = 'Active'
ORDER BY buys.date DESC

In [4]:
buys_df[['cost_amt','net','qty']].sum()

cost_amt   705,000.00
net        706,561.50
qty         12,000.00
dtype: float64

In [5]:
qty = 12_000
net_cost = 706_560
net_cost, qty

(706560, 12000)

### Record selection for sold stocks

In [6]:
sql = '''
SELECT name, YEAR(sells.date) AS sell_year, MONTH(sells.date) AS sell_month,  
             YEAR(buys.date) AS buy_year, MONTH(buys.date) AS buy_month,
sells.price AS sell_price, buys.price AS buy_price, 
(sells.price - buys.price) AS diff, qty, 
(sells.price * qty) AS sell_amt,
(buys.price * qty) AS buy_amt,
(sells.price - buys.price) * qty AS gross, 
ROUND((sells.price - buys.price)/buys.price*100,2) AS pct, profit, buys.kind
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s' 
ORDER BY sell_year DESC, sell_month DESC, name'''

sql = sql % (name)
sells_df = pd.read_sql(sql, conpf)
print(sql)
sells_df

SELECT name, YEAR(sells.date) AS sell_year, MONTH(sells.date) AS sell_month,
             YEAR(buys.date) AS buy_year, MONTH(buys.date) AS buy_month,
sells.price AS sell_price, buys.price AS buy_price,
(sells.price - buys.price) AS diff, qty,
(sells.price * qty) AS sell_amt,
(buys.price * qty) AS buy_amt,
(sells.price - buys.price) * qty AS gross,
ROUND((sells.price - buys.price)/buys.price*100,2) AS pct, profit, buys.kind
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = 'PTTGC'
ORDER BY sell_year DESC, sell_month DESC, name

,name,sell_year,sell_month,buy_year,buy_month,sell_price,buy_price,diff,qty,sell_amt,buy_amt,gross,pct,profit,kind
0,PTTGC,2021,12,2019,7,59.00,66.75,-7.75,2000,"118,000.00","133,500.00","-15,500.00",-11.61,"-16,057.05",DTD
1,PTTGC,2021,12,2021,3,58.75,66.75,-8.00,600,"35,250.00","40,050.00","-4,800.00",-11.99,"-4,966.78",DTD
2,PTTGC,2021,12,2021,4,58.75,66.75,-8.00,1000,"58,750.00","66,750.00","-8,000.00",-11.99,"-8,277.96",DTD
3,PTTGC,2020,6,2018,10,53.25,75.50,-22.25,2000,"106,500.00","151,000.00","-44,500.00",-29.47,"-45,070.34",SS
4,PTTGC,2020,6,2018,6,49.00,75.50,-26.50,2000,"98,000.00","151,000.00","-53,000.00",-35.10,"-53,551.51",SS
5,PTTGC,2020,3,2018,6,43.25,75.50,-32.25,3000,"129,750.00","226,500.00","-96,750.00",-42.72,"-97,539.06",TP
6,PTTGC,2017,7,2017,6,71.50,69.00,2.50,3000,"214,500.00","207,000.00","7,500.00",3.62,"6,566.42",XP
7,PTTGC,2017,2,2017,2,72.25,69.00,3.25,4000,"289,000.00","276,000.00","13,000.00",4.71,"11,748.58",XP

In [7]:
sells_df[['gross','profit','qty']].sum()

gross    -202,050.00
profit   -207,147.70
qty        17,600.00
dtype: float64

In [8]:
profit = -207_000

### Record selection for dividends

In [9]:
sql = '''
SELECT name, p_date, amt, net, amt-net AS refund,
year, quarter AS q, x_date, number, ppu, (net / number * 1000) AS div_1k
FROM dividends
WHERE name = '%s' 
ORDER BY p_date DESC'''
sql = sql % (name)
print(sql)

div_df = pd.read_sql(sql, conpf)
div_df

SELECT name, p_date, amt, net, amt-net AS refund,
year, quarter AS q, x_date, number, ppu, (net / number * 1000) AS div_1k
FROM dividends
WHERE name = 'PTTGC'
ORDER BY p_date DESC

,name,p_date,amt,net,refund,year,q,x_date,number,ppu,div_1k
0,PTTGC,2022-09-21,"9,000.00","8,100.00",900.00,2022,2,2022-09-02,12000,0.75,675.00
1,PTTGC,2022-04-22,"15,750.00","14,175.00","1,575.00",2021,4,2022-02-28,9000,1.75,"1,575.00"
2,PTTGC,2021-09-21,"16,000.00","14,400.00","1,600.00",2021,2,2021-08-23,8000,2.00,"1,800.00"
3,PTTGC,2021-04-23,"2,000.00","1,800.00",200.00,2020,4,2021-02-25,2000,1.00,900.00
4,PTTGC,2020-04-28,"9,000.00","8,100.00",900.00,2019,4,2020-04-28,9000,1.00,900.00
5,PTTGC,2019-09-13,"9,000.00","8,100.00",900.00,2019,2,2019-09-13,9000,1.00,900.00
6,PTTGC,2019-04-24,"15,000.00","13,680.00","1,320.00",2018,4,2019-04-24,6000,2.50,"2,280.00"
7,PTTGC,2018-09-18,"7,875.00","7,650.00",225.00,2018,2,2018-09-18,4500,1.75,"1,700.00"

In [10]:
div_grp = div_df.groupby(['name'], as_index=True).agg(
    {
        'amt':['sum'],
        'net':['sum'], 
        'number':['mean','count'],         
    }
)
div_grp

            amt       net   number
            sum       sum     mean count
name
PTTGC 83,625.00 76,005.00 7,437.50     8

In [11]:
acc_div = 76_000
acc_div

76000

In [15]:
sell_amt = net_cost - acc_div - profit
sell_amt, qty

(837560, 12000)

In [13]:
sell_price = sell_amt / qty
sell_price

69.79666666666667

In [14]:
sell_price = 25.25 # + unit_plus
sales_amt = sell_price * qty
sales_amt

303000.0

### Plan A: Sell at 70 x 12,000 shares